# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：获得用户输入的一个字符串，输出其中字母 a 的出现次数。 

要求：输入一个带有字母 a 的字符串,输出一个数字，表示字符串中 a 的个数
      例如：（输入：Alice is a girl 输出：1 ）如样张所示

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
#**********Program**********




#**********  End  **********
