# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun求一个不多于5位的正整数的位数，
      该数在主函数中输入，并在主函数中输出结果。

要求：使用if语句完成

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def fun(m):
    #**********Program**********




    #**********  End  **********

def main():
    print("【请分别三次计算问题：】")
    for i in range(3):
        print("【第%d次：】" %(i+1))  
        num = int(input("【请输入一个不多于5位的整数num：】"))   
        ws=fun(num);
        print("【%d是一个】%d【位数】" %(num,ws));
    
if __name__ == '__main__':
    main()


