# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：给定一个整数数字0x1010，请依次输出Python语言中十六进制、
      十进制、八进制和二进制表示形式，使用英文逗号分隔。  

要求：依次输出Python语言中给定数字的十六进制、十进制、
      八进制和二进制表示形式，使用英文逗号分隔。(使用format）

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
#**********Program**********
print('0x{0:x},{0:},0o{0:o},0b{0:b}'.format(0x1010))



#**********  End  **********
