# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：试题提供了一个“字符.txt”文件。基础中文字符的Unicode编码范围
      是[0x4e00,0x9fa5]，请统计给定文本中存在多少该范围内的基础
      中文字符以及每个字符的出现次数。保存在“字符统计.txt”文件中。
      示例输出中括号内是对应字符的十六进制Unicode编码形式，冒号后是
      出现次数，换行输出到文件中。

输出示例;侠(0x4fa0):8
         客(0x5ba2):6
         行(0x884c):11
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
fi = open("字符.txt", "r")
fo = open("字符统计.txt", "w")
#**********Program**********






#**********  End  **********
fo.write("\n".join(ls))
fi.close()
fo.close()

