# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：补充函数getLastDay(y,m)，其功能是计算y年m月共有多少天。

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def getLastDay(y,m):
    #**********Program**********



    #**********  End  **********

def  leapYear( y ):
     if y<1:
         y=1
     if (y % 400)== 0:
         lp = 1
     elif (y % 100)== 0:
         lp=0
     elif (y % 4)==0:
          lp =1
     else:
         lp = 0
     return lp

def main():
    print("【请分别三次计算某年某月共有多少天：】")
    for n in range(4):
        print("【第%d次：】" %(n+1))
        y = int(input("【请输入年份y：】"))
        m = int(input("【请输入月份m：】"))
        print(getLastDay(y,m))
    
if __name__ == '__main__':
    main()

