# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：考虑异常情况，编写程序从用户处获得一个全数字
     （可以含小数点或复数标记）输入，如果用户输入不
      符合，则要求用户再次输入，直至满足条件。打印输
      出这个输入。 

输出实例：
 sdf
 3
3
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''

#**********Program**********







#**********  End  **********

