# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：根据输入正整数 n，作为财务数据，输出一个宽度为 20 字符，
      n 右对齐显示，带千位分隔符的效果，使用减号字符“-”填充。
      如果输入正整数超过 20 位，则按照真实长度输出。提示代码
      如下：
输出示例：
123
-----------------123
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''


n = input()
#**********Program**********



#**********  End  **********

