# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请补充横线处的代码，让 Python 帮你随机选一个饮品吧！

要求：随机输出 listC 列表中的元素

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
#**********Program**********

import  random
listC = ['加多宝','雪碧','可乐','勇闯天涯','椰子汁']
print( random.choice (listC))


#**********  End  **********


