# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：给定一个数字 123456，请采用宽度为 25、使用format()函数，
      右对齐方式打印输出，使用加号“+”填充。 

要求：采用宽度为 25、右对齐方式打印输出，使用加号“+”填充。

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
#**********Program**********
print('{:+>25}'.format(123456))



#**********  End  **********
