# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：经常会有要求用户输入整数的计算需求，但用户未必一定输入
      整数。为了提高用户体验，编写 getInput() 函数处理这样的
      情况。请补充如下代码，如果用户输入整数，则直接输出整数
      并退出，如果用户输入的不是整数，则要求用户重新输入，直至
      用户输入整数为止。

提示：请使用try/except语句。

输出示例：
1.3
3
3
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''

def getInput():
#**********Program**********

____①____ # 可以是多行代码
return ____②____  # 只能是单行代码

#**********  End  **********
print(getInput())

