# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：打开一个文件 a.txt，如果该文件不存在则创建，
      存在则产生异常并报警。请补充如下代码
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
#**********Program**********

try:
 f = open(____①____)
____②____:
     print("文件存在，请小心读取！")

#**********  End  **********

