# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：使用 turtle 库的 turtle.fd() 函数和 turtle.seth() 函
      数绘制一个等边三角形，边长为 200 像素，效果如样张所示。
      请结合程序整体框架，根据提示代码完成程序。

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
import turtle as t
#**********Program**********

for i in range(0, ____①____):
    t.seth(i*____②____)
    t.fd(____③____)

#**********  End  **********

