# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：使用 turtle 库的 turtle.circle() 函数、turtle.seth() 函数
      和 turtle.left() 函数绘制一个四瓣花图形，效果如样张所示。
      请结合程序整体框架，补充横线处代码，从左上角花瓣开始，
      逆时针作画。
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''

import turtle as t

#**********Program**********

for i in range(0,____①____):
    t.seth(____②____)
    t.circle(200, 90)
    t.seth(____③____)
   
#**********  End  **********

    t.circle(200, 90)

