# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：根据输入字符串 s，输出一个宽度为 15 字符，字符串 s 
      居中显示，以“=”填充的格式。如果输入字符串超过 15 个
      字符，则输出字符串前 15 个字符。提示代码如下：

输出示例：
qee
======qee======

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
for i in range(2):
    s = input()  # "请输入一个字符串:"
#**********Program**********

    print(____①____)

#**********  End  **********

