# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：使用 turtle 库绘制八角星形，效果如样张1所示。
      阅读程序框架，补充横线处代码。
提示：①位置设置颜色取值为金色（255,215,0）
      ②位置绘制8条线
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
import turtle as t
t.colormode(255)
#**********Program**********

t.color(____①____)    
t.begin_fill()
for x in range(1,____②____):  
    
#**********  End  **********
    t.forward(200)
    t.left(225)
t.end_fill()
t.hideturtle()
t.done()

