# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写main函数，从键盘输入一个正整数x代表分钟数，
      将其转换成用小时h和分钟m表示，然后输出成几小时几分。

要求：main函数包含输出语句，格式为：??小时??分钟

例如：括号内是说明
      输入：
        70   (x=70)
      输出：
        1小时10分钟

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def main():
    print("【请连续三次转换分钟数：】")
    for n in range(3):
        print("【第%d次：】" %(n+1))
        x = int(input("【请输入分钟数值: 】"))
        #**********Program**********

        


        #**********  End  **********
    
if __name__ == '__main__':
    main()   

