# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：s="123"是一个整数形式字符串，编写程序判断 s 是否是整数形式字符串。
      如果是则输出 True，否则输出 False。要求代码不超过 2 行。

要求：输出 True 或者 False

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
#**********Program**********




#**********  End  **********
