# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请补充横线处的代码，listA中存放了已点的餐单，
      让Python帮你增加一个“红烧肉”，去掉一个“水煮干丝”。

要求：输出一个修改后的列表

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''
listA = ['水煮干丝','平桥豆腐','白灼虾','香菇青菜','西红柿鸡蛋汤']
#**********Program**********

listA.___(1)____ ("红烧肉")
listA.____(2)____ ("水煮干丝")

#**********  End  **********
print(listA)
