# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编fun函数，求4×4整型数组的主对角线元素的和。

说明：如下图所示为一个4×4整型数组
      1   2   3   4
      5   6   7   8
      9   10  11  12
      13  14  15  16

例如：分别输入16个整型数值并按回车继续
      1
      2
      3
      4
      …
      16
      输出：34.0

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def fun(a):
    #**********Program**********




    #**********  End  **********
   
def main():
    print("【分别输入16个整型数值并按回车输出结果:】")
    a = []
    for i in range(4):
        a.append([])
        for j in range(4):
            a[i].append(float(input("【请输入任意一个整型数值，并按回车继续:】")))
    sum = fun(a)
    print(sum)

if __name__ == '__main__':
    main()        

