# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：0x4DC0 是一个十六进制数，它对应的 Unicode 编码是中国
      古老的《易经》六十四卦的第一卦，请输出第 51 卦（震卦）
      对应的 Unicode 编码的二进制、十进制、八进制和十六进制
      格式输出 True 或者 False

输出示例：二进制100110111110010、十进制19954、八进制46762、十六进制4df2

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''

#**********Program**********

print("二进制{____①____}、十进制{____②____}、八进制{____③____}、
十六进制{____④____}".format(____⑤____))

#**********  End  **********

