# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：使用 turtle 库绘制正方形螺旋线，效果如样张1所示。
      阅读程序框架，补充横线处代码。
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''

import turtle
n = 10
for i in range(1,10,1):
    for j in [90,180,-90,0]:
#**********Program**********

        turtle.seth (____①____)
        turtle.fd(____②____)

#**********  End  **********
        n += 5

